IdeaRS.OpenModel.Connection.BendData
Provides data of bend

IdeaRS.OpenModel.Connection.BendData.Plate1Id
First plate

IdeaRS.OpenModel.Connection.BendData.Plate2Id
Second plate

IdeaRS.OpenModel.Connection.BendData.Radius
Radius of bend

IdeaRS.OpenModel.Connection.BendData.Point1OfSideBoundary1
Side boundary first plate point 1

IdeaRS.OpenModel.Connection.BendData.Point2OfSideBoundary1
Side boundary first plate point 2

IdeaRS.OpenModel.Connection.BendData.EndFaceNormal1
End Face Normal vector

IdeaRS.OpenModel.Connection.BendData.Point1OfSideBoundary2
Side boundary second plate point 1

IdeaRS.OpenModel.Connection.BendData.Point2OfSideBoundary2
Side boundary second plate point 2